## Pandas Join

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'A':[1,2,3],
                   'B':[10,20,30]})

In [3]:
df2 = pd.DataFrame({'C':[4,5,6],
                   'D':[40,50,60]})

**display ( ) ---> function which is used to display dataframe**

In [4]:
display(df1,df2)

   A   B
0  1  10
1  2  20
2  3  30

   C   D
0  4  40
1  5  50
2  6  60

**1. Join() function ---> joins the dataframe, series and lis to dataframes**

In [5]:
df1.join(df2)

   A   B  C   D
0  1  10  4  40
1  2  20  5  50
2  3  30  6  60

***To use join() method we need to have same index within both of the dataframe***

In [7]:
df1 = pd.DataFrame({'A':[1,2,3],
                   'B':[10,20,30]}, index = ['a','b','c'])

In [8]:
df1

   A   B
a  1  10
b  2  20
c  3  30

In [9]:
df2

   C   D
0  4  40
1  5  50
2  6  60

***due to different index in both of the dataframe it shows the NaN value***

In [10]:
df1.join(df2)

   A   B   C   D
a  1  10 NaN NaN
b  2  20 NaN NaN
c  3  30 NaN NaN

**2. Join two dataframe with different Length**

In [13]:
df3 = pd.DataFrame({'A':[1,2,3],
                   'B':[10,20,30]})

df4 = pd.DataFrame({'C':[4,5],
                   'D':[40,50]})
display(df1,df2)

   A   B
a  1  10
b  2  20
c  3  30

   C   D
0  4  40
1  5  50
2  6  60

In [14]:
df3.join(df4)

   A   B    C     D
0  1  10  4.0  40.0
1  2  20  5.0  50.0
2  3  30  NaN   NaN

**3. how parameter --> inner/outer, left/right**

In [16]:
df3.join(df4, how='left')

   A   B    C     D
0  1  10  4.0  40.0
1  2  20  5.0  50.0
2  3  30  NaN   NaN

In [17]:
df3.join(df4, how='right')

   A   B  C   D
0  1  10  4  40
1  2  20  5  50

In [18]:
df3.join(df4, how='inner')

   A   B  C   D
0  1  10  4  40
1  2  20  5  50

In [19]:
df3.join(df4, how='outer')

   A   B    C     D
0  1  10  4.0  40.0
1  2  20  5.0  50.0
2  3  30  NaN   NaN

**4. To join two dataframe that has same column Name**

In [20]:
df5 = pd.DataFrame({'A':[1,2,3],
                   'B':[10,20,30]})

df6 = pd.DataFrame({'A':[4,5],
                   'D':[40,50]})
display(df5,df6)

   A   B
0  1  10
1  2  20
2  3  30

   A   D
0  4  40
1  5  50

In [ ]:
***If we siply join df5 and df6 then here it generates error due to having same column name in both of the dataframe 
so to resolve this we use ''